Repository: patestevao/bitcoindesigned-infographics-i18n
Catalog: what-*-pow/*.po
Languages: de

source: THE BITCOIN MINING SAGA - PART II
de: DIE BITCOIN MINING SAGA - TEIL II

source: What is Proof of Work (PoW)?
de: Was ist Proof of Work (PoW)?

source: It’s a method to ensure that the information (the new block) was difficult (costly, time-consuming) to be made.
de: Es ist eine Methode um sicherzustellen, dass die Information (der neue Block) schwer (aufwändig, zeitintensiv) zu erschaffen war.

source: It costs processing power.
de: Es kostet Rechenleistung.

source: Which can be translated to: hardware, energy and time.
de: Was übersetzt werden kann in: Hardware, Energie und Zeit.

source: It’s easy, on the other hand, for others to check if the requirements were met.
de: Es ist allerdings für Andere einfach zu überprüfen, ob die Anforderungen erfüllt wurden.

source: In Practice
de: In der Praxis

source: (made simple)
de: (vereinfacht)

source: BEGIN HERE
de: HIER ANFANGEN

source: Miner proposes new block
de: Miner schlägt neuen Block vor

source: Header of the most recent block
de: Kopfzeile des neuesten Blocks

source: NONCE (an incremental number)
de: NONCE (eine zunehmende Nummer)

source: Combines and hashes
de: Kombiniert und Hasht

source: HASH number
de: HASH Nummer

source: Mining Difficulty
de: Mining-Schwierigkeit

source: Determines
de: Bestimmt

source: Target Value
de: Zielwert

source: Compares
de: Vergleicht

source: Is HASH < Target Value?
de: Ist HASH < Zielwert?

source: NO
de: NEIN

source: Increments and try again
de: Inkrementiere und versuche erneut

source: YES
de: JA

source: You solved the PoW!
de: Sie haben das PoW gelöst!

source: Mining Reward
de: Mining-Belohnung

source: Translator: [Your name/handle or "Crowdsourced translation"]
de: Translator: 21 Lectures AG
